app/controllers/submissions_controller.rb

  def index
    @submissions = Submission.all
---
SELECT `submissions`.* FROM `submissions`

  def show
    @submission = Submission.find(params[:id])
---
SELECT `submissions`.* FROM `submissions` WHERE `submissions`.`id` = 0 LIMIT 1

  def edit
    @submission = Submission.find(params[:id])
---
SELECT `submissions`.* FROM `submissions` WHERE `submissions`.`id` = 1 LIMIT 1

  def create
    @submission = Submission.new(params[:submission].merge(:user_id => current_user.id, :challenge => 1))

    respond_to do |format|
      if @submission.save
---
INSERT INTO `submissions` (`challenge`, `created_at`, `description`, `github_url`, `name`, `updated_at`, `user_id`) VALUES (0, '2013-02-16 23:48:35', 'This is great!', 'http://me.com', 'Testing123', '2013-02-16 23:48:35', 1)