app/controllers/users_controller.rb

	def create
	  @user = User.new(params[:user])
	  if @user.save
---
INSERT INTO `users` (`created_at`, `email`, `password_hash`, `password_salt`, `updated_at`) VALUES ('2013-02-16 22:23:54', 'colby@aley.me', '$2a$10$lCBCYGX7oz/71TvGMuKp5upsRPUBRHPYPhyzp9OgdHnL.sT3cW7W2', '$2a$10$lCBCYGX7oz/71TvGMuKp5u', '2013-02-16 22:23:54')

	def show
		@user = User.find_by_id(params[:id])
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1